USER_TYPE_CHOICES = (
    ('admin', 'Администратор'),
    ('user', 'Пользователь'),
    ('agent', 'Агент'),
    ('deliver', 'Достовщик'),
)

REGIONS = (
    ('bulungur', 'Булунгур'),
    ('ishtikhon', 'Иштихон'),
    ('jomboy', 'Джомбой'),
    ('paishanba', 'Пайшанба'),
    ('koshrabot', 'Кошработ'),
    ('oqtosh', 'Октош'),
    ('nurobod', 'Нуробод'),
    ('laish', 'Лаиш'),
    ('ziadin', 'Зиадин'),
    ('payariq', 'Паярик'),
    ('juma', 'Джума'),
    ('gulabad', 'Гулабад'),
    ('tayloq', 'Тойлок'),
    ('urgut', 'Ургут'),
    ('g_samarqand', 'г. Самарканд '),
    ('r_samarqand', 'р. Самарканд '),
)

marker_data = {
    'bulungur': (39.762947, 67.272900, 11),
    'ishtikhon': (39.965300, 66.486183, 11),
    'jomboy': (39.695714, 67.098906, 11),
    'paishanba': (40.010864, 66.229893, 11),
    'koshrabot': (40.246086, 66.649568, 11),
    'oqtosh': (39.921635, 65.925364, 11),
    'nurobod': (39.608295, 66.283298, 11),
    'laish': (39.879174, 66.751985, 11),
    'ziadin': (40.030119, 65.659607, 11),
    'payariq': (39.990041, 66.846353, 11),
    'juma': (39.715073, 66.661381, 11),
    'gulabad': (39.582595, 66.956469, 11),
    'tayloq': (39.598622, 67.093156, 11),
    'urgut': (39.408814, 67.243391, 11),
    'g_samarqand': (39.654543, 66.968847, 11),
    'r_samarqand': (39.581656, 66.958047, 11),
}